# 三层交换机基本配置教程（Cisco Packet Tracer 8.2.1模拟环境）

## 目录
1. [实验概述](#实验概述)
2. [实验环境准备](#实验环境准备)
3. [三层交换机技术原理](#三层交换机技术原理)
4. [详细实验步骤](#详细实验步骤)
5. [验证配置结果](#验证配置结果)
6. [排除常见问题](#排除常见问题)
7. [扩展知识](#扩展知识)

## 实验概述

### 实验名称
三层交换机端口配置

### 实验目的
配置并开启三层交换机的三层功能，实现路由功能，并验证其工作状态。

### 背景描述
公司现有1台三层交换机，需要测试该交换机的三层功能是否工作正常。通过配置三层交换机并将其连接到路由器，验证其路由功能是否正确运行。

### 实验设备
- 三层交换机S3762-01（1台）
- 路由器R1762-02（1台）
- 直连线（1条）

## 实验环境准备

### 实验拓扑
```
+------------------+                  +------------------+
|                  |      直连线       |                  |
|  三层交换机      |------------------+|     路由器       |
|  S3762-01        |                  |    R1762-02      |
|  F0/5            |                  |    F1/0          |
|  192.168.5.1/24  |                  |  192.168.5.2/24  |
+------------------+                  +------------------+
```

### 步骤1：创建实验拓扑

1. 启动Cisco Packet Tracer 8.2.1
2. 添加一台三层交换机S3762-01（使用3560或类似的三层交换机）
3. 添加一台路由器R1762-02（使用1841、2811或类似的路由器）
4. 使用直连线连接：
   - 交换机的F0/5端口
   - 路由器的F1/0端口

## 三层交换机技术原理

三层交换机是集成了二层交换和三层路由功能的网络设备，它具有以下主要特性：

1. **"一次路由，多次交换"原理**：
   - 首次数据包通过路由模块进行路由查找
   - 后续数据包通过硬件交换转发，无需再次路由查找
   - 这大大提高了网络转发性能

2. **端口特性**：
   - 三层交换机的端口在默认情况下是二层交换端口
   - 可以将端口转换为三层路由端口（通过`no switchport`命令）
   - 三层端口可以配置IP地址，如同路由器接口

3. **性能优势**：
   - 相比传统路由器，在局域网环境中转发性能更高
   - 端口密度更大，更适合多个局域网段互联
   - 成本效益更高

4. **路由功能**：
   - 支持静态路由和动态路由协议（如RIP、OSPF、EIGRP等）
   - 可以实现VLAN间路由（使用SVI接口）
   - 支持ACL（访问控制列表）等高级功能

## 详细实验步骤

### 步骤1：开启三层交换机的路由功能

1. 连接到三层交换机S3762-01的控制台：
   - 在Packet Tracer中，点击交换机图标
   - 选择"CLI"标签页

2. 进入特权模式：
   ```
   Switch> enable
   ```

3. 进入全局配置模式：
   ```
   Switch# configure terminal
   ```

4. 设置交换机名称（可选）：
   ```
   Switch(config)# hostname S3762-01
   ```

5. 开启三层交换机的IP路由功能：
   ```
   S3762-01(config)# ip routing
   ```

   > **说明**：`ip routing`命令开启交换机的全局路由功能，这是配置三层功能的必要条件。某些型号的交换机默认已启用此功能，但执行此命令以确保功能开启不会有负面影响。

### 步骤2：配置三层交换机物理端口的三层功能

1. 进入要配置为三层端口的接口配置模式：
   ```
   S3762-01(config)# interface fastEthernet 0/5
   ```

2. 将端口从二层模式转换为三层模式：
   ```
   S3762-01(config-if)# no switchport
   ```

   > **说明**：`no switchport`命令将端口从默认的二层交换模式转换为三层路由模式。这是配置物理端口IP地址的前提条件。

3. 配置接口IP地址：
   ```
   S3762-01(config-if)# ip address 192.168.5.1 255.255.255.0
   ```

4. 启用接口：
   ```
   S3762-01(config-if)# no shutdown
   ```

5. 退出接口配置模式并返回到特权模式：
   ```
   S3762-01(config-if)# end
   ```

### 步骤3：配置路由器接口

1. 连接到路由器R1762-02的控制台：
   - 在Packet Tracer中，点击路由器图标
   - 选择"CLI"标签页

2. 进入特权模式：
   ```
   Router> enable
   ```

3. 进入全局配置模式：
   ```
   Router# configure terminal
   ```

4. 设置路由器名称（可选）：
   ```
   Router(config)# hostname R1762-02
   ```

5. 进入接口配置模式：
   ```
   R1762-02(config)# interface fastEthernet 1/0
   ```

6. 配置接口IP地址：
   ```
   R1762-02(config-if)# ip address 192.168.5.2 255.255.255.0
   ```

7. 启用接口：
   ```
   R1762-02(config-if)# no shutdown
   ```

8. 退出接口配置模式并返回到特权模式：
   ```
   R1762-02(config-if)# end
   ```

## 验证配置结果

### 检查三层交换机端口配置

1. 查看接口详细信息：
   ```
   S3762-01# show interfaces fastEthernet 0/5
   ```

   您应该能看到类似以下输出：
   ```
   FastEthernet0/5 is up, line protocol is up
     Hardware is Fast Ethernet, address is xxxx.xxxx.xxxx
     Internet address is 192.168.5.1/24
     MTU 1500 bytes, BW 100000 Kbit, DLY 1000 usec,
     ...
   ```

   关键点：
   - 确认接口状态为"up, line protocol is up"
   - 确认接口有正确的IP地址(192.168.5.1)
   - 确认没有出现"switchport"相关信息，表明端口已转为三层模式

2. 查看IP接口简要信息：
   ```
   S3762-01# show ip interface brief
   ```

   您应该能看到类似以下输出：
   ```
   Interface           IP-Address      OK? Method Status    Protocol
   FastEthernet0/5     192.168.5.1     YES manual up        up
   ...
   ```

3. 检查路由功能是否开启：
   ```
   S3762-01# show ip route
   ```

   您应该能看到类似以下输出：
   ```
   Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
          D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
          N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
          E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
          i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
          * - candidate default, U - per-user static route, o - ODR
          P - periodic downloaded static route

   Gateway of last resort is not set

   C    192.168.5.0/24 is directly connected, FastEthernet0/5
   ```

   确认能看到通过F0/5接口直连的路由条目。

### 测试三层交换机与路由器间的连通性

1. 从路由器ping交换机：
   ```
   R1762-02# ping 192.168.5.1
   ```

   应该看到成功的ping响应：
   ```
   Type escape sequence to abort.
   Sending 5, 100-byte ICMP Echoes to 192.168.5.1, timeout is 2 seconds:
   !!!!!
   Success rate is 100 percent (5/5), round-trip min/avg/max = 1/4/10 ms
   ```

2. 从交换机ping路由器：
   ```
   S3762-01# ping 192.168.5.2
   ```

   应该看到成功的ping响应：
   ```
   Type escape sequence to abort.
   Sending 5, 100-byte ICMP Echoes to 192.168.5.2, timeout is 2 seconds:
   !!!!!
   Success rate is 100 percent (5/5), round-trip min/avg/max = 1/4/10 ms
   ```

### 查看运行配置

查看三层交换机的运行配置，确认所有配置正确：
```
S3762-01# show running-config
```

关注以下配置项：
- 全局配置中的`ip routing`命令
- FastEthernet0/5接口的配置：
  - `no switchport`命令
  - 正确的IP地址和子网掩码

## 排除常见问题

如果遇到连通性问题，请检查以下几个方面：

### 1. 检查物理连接

- 确认直连线连接到了正确的端口（交换机F0/5和路由器F1/0）
- 在Packet Tracer中，确认连接线显示为绿色（表示链路正常）

### 2. 检查接口状态

在交换机和路由器上都执行以下命令：
```
show interfaces
```

确保两端接口都显示为"up, line protocol is up"状态。

### 3. 检查IP配置

在两台设备上验证IP配置：
```
show ip interface brief
```

确保：
- 交换机F0/5端口：192.168.5.1/24
- 路由器F1/0端口：192.168.5.2/24

### 4. 检查路由功能

在交换机上执行：
```
show ip route
```

确保交换机有到192.168.5.0/24网络的路由条目。

### 5. 重新配置端口

如果问题仍然存在，可以尝试重新配置交换机端口：
```
S3762-01(config)# interface fastEthernet 0/5
S3762-01(config-if)# shutdown
S3762-01(config-if)# no switchport
S3762-01(config-if)# ip address 192.168.5.1 255.255.255.0
S3762-01(config-if)# no shutdown
```

## 扩展知识

### 三层交换机的VLAN间路由

除了将物理端口配置为路由端口外，三层交换机还可以通过SVI(Switched Virtual Interface)实现VLAN间路由：

1. 创建VLAN：
   ```
   S3762-01(config)# vlan 10
   S3762-01(config-vlan)# name VLAN10
   S3762-01(config-vlan)# exit
   S3762-01(config)# vlan 20
   S3762-01(config-vlan)# name VLAN20
   S3762-01(config-vlan)# exit
   ```

2. 将端口分配到VLAN：
   ```
   S3762-01(config)# interface fastEthernet 0/1
   S3762-01(config-if)# switchport mode access
   S3762-01(config-if)# switchport access vlan 10
   S3762-01(config-if)# exit
   
   S3762-01(config)# interface fastEthernet 0/2
   S3762-01(config-if)# switchport mode access
   S3762-01(config-if)# switchport access vlan 20
   S3762-01(config-if)# exit
   ```

3. 创建VLAN接口(SVI)：
   ```
   S3762-01(config)# interface vlan 10
   S3762-01(config-if)# ip address 192.168.10.1 255.255.255.0
   S3762-01(config-if)# no shutdown
   S3762-01(config-if)# exit
   
   S3762-01(config)# interface vlan 20
   S3762-01(config-if)# ip address 192.168.20.1 255.255.255.0
   S3762-01(config-if)# no shutdown
   S3762-01(config-if)# exit
   ```

### 配置路由协议

三层交换机可以运行常见的路由协议，例如RIP、OSPF或EIGRP：

1. 配置RIP示例：
   ```
   S3762-01(config)# router rip
   S3762-01(config-router)# version 2
   S3762-01(config-router)# network 192.168.5.0
   S3762-01(config-router)# no auto-summary
   ```

2. 配置OSPF示例：
   ```
   S3762-01(config)# router ospf 1
   S3762-01(config-router)# network 192.168.5.0 0.0.0.255 area 0
   ```

### 配置静态路由

在三层交换机上配置静态路由：
```
S3762-01(config)# ip route 192.168.6.0 255.255.255.0 192.168.5.2
```

这将创建一条静态路由，指定到达192.168.6.0/24网络的下一跳为192.168.5.2（路由器）。

### 端口类型比较

| 特性 | 二层交换端口 | 三层路由端口 | SVI接口 |
|------|------------|------------|---------|
| 连接类型 | 连接终端设备或其他交换机 | 连接路由器或其他网络设备 | 虚拟接口，不直接连接设备 |
| 配置方式 | 默认状态，无需特殊配置 | 使用`no switchport`命令转换 | 通过`interface vlan`命令创建 |
| IP地址 | 不能配置 | 可以配置 | 可以配置 |
| VLAN关联 | 可以分配到VLAN | 不属于任何VLAN | 代表整个VLAN |
| 主要用途 | 二层数据交换 | 三层路由转发 | VLAN间路由 |

---

通过本教程，您已学习了如何在Cisco Packet Tracer中配置三层交换机的基本三层功能，将交换机端口从默认的二层模式转换为三层路由模式，并验证了与路由器之间的连通性。三层交换机结合了交换机的高端口密度和路由器的功能，在企业网络中有着广泛的应用。 