# 查看路由器的系统和配置信息教程（Cisco Packet Tracer 8.2.1模拟环境）

## 目录
1. [实验概述](#实验概述)
2. [模拟环境准备](#模拟环境准备)
3. [查看路由器信息技术原理](#查看路由器信息技术原理)
4. [详细实验步骤](#详细实验步骤)
5. [命令输出解析](#命令输出解析)
6. [常见问题和注意事项](#常见问题和注意事项)
7. [扩展知识](#扩展知识)

## 实验概述

### 实验名称
查看路由器的系统和配置信息

### 实验目的
掌握查看路由器系统和配置信息的方法，了解当前路由器的工作状态。

### 背景描述
作为公司新任网络管理员，第一天上班时需要掌握公司路由器的当前工作情况。通过查看路由器的系统信息和配置信息，了解公司的设备和网络环境。

### 实验环境
本实验在Cisco Packet Tracer 8.2.1模拟软件中进行，通过配置一台路由器并连接一台PC，学习如何查看路由器的各项系统和配置信息。

## 模拟环境准备

### 步骤1：启动Cisco Packet Tracer 8.2.1

打开Cisco Packet Tracer 8.2.1软件。

### 步骤2：创建实验拓扑

1. 点击文件菜单中的"新建"或使用快捷键Ctrl+N创建新拓扑
2. 在左侧设备面板中，添加一台路由器
   - 点击"网络设备"选项卡
   - 选择"路由器"类别
   - 拖放1841或2811系列路由器到工作区
   - 可以将路由器命名为R1762

3. 添加一台PC
   - 点击"终端设备"选项卡
   - 选择"PC"
   - 拖放PC到工作区

4. 连接路由器和PC
   - 选择"连接"选项卡
   - 选择"直通线"（Copper Straight-Through）
   - 点击PC，选择其网卡接口
   - 点击路由器，选择FastEthernet1/0接口
   
   > **注意**：在真实环境中，您可能还需要使用Console线缆连接PC和路由器的Console端口来进行初始配置。在Packet Tracer中，我们可以直接点击路由器图标访问CLI。

### 步骤3：准备路由器控制台访问

点击路由器图标，选择"CLI"选项卡来直接访问命令行界面。

## 查看路由器信息技术原理

在查看路由器系统和配置信息前，需要了解以下技术原理：

1. **路由器配置模式**：
   - 用户模式（User EXEC）：提示符为`Router>`，权限有限，只能查看基本信息
   - 特权模式（Privileged EXEC）：提示符为`Router#`，可以查看所有系统信息和配置信息
   - 查看系统和配置信息的命令需要在特权模式下执行

2. **路由器配置存储**：
   - RAM（随机存取存储器）：存储当前运行的配置（running-config），断电后丢失
   - NVRAM（非易失性RAM）：存储启动配置文件（startup-config），断电后不丢失
   - Flash：存储IOS（操作系统）镜像
   - ROM：存储启动程序和基本诊断软件

3. **常用查看命令**：
   - `show version`：显示路由器的硬件和软件版本信息
   - `show ip route`：显示路由器的路由表信息
   - `show running-config`：显示当前正在运行的配置信息
   - `show startup-config`：显示保存在NVRAM中的启动配置信息
   - `show interfaces`：显示接口的详细信息

## 详细实验步骤

### 步骤1：路由器基本配置

1. 点击路由器，选择"CLI"选项卡
2. 在命令行界面中，按照以下步骤进行配置：

   进入特权模式：
   ```
   Router> enable
   ```

   进入全局配置模式：
   ```
   Router# configure terminal
   ```

   设置路由器主机名：
   ```
   Router(config)# hostname Ra
   ```

   进入FastEthernet1/0接口配置模式：
   ```
   Ra(config)# interface FastEthernet1/0
   ```

   配置接口IP地址：
   ```
   Ra(config-if)# ip address 192.168.1.1 255.255.255.0
   ```

   启用接口：
   ```
   Ra(config-if)# no shutdown
   ```

   返回特权模式：
   ```
   Ra(config-if)# end
   ```

3. 为了本实验的完整性，让我们也配置一个Serial接口：

   进入全局配置模式：
   ```
   Ra# configure terminal
   ```

   进入Serial1/2接口配置模式：
   ```
   Ra(config)# interface Serial1/2
   ```

   配置接口IP地址：
   ```
   Ra(config-if)# ip address 1.1.1.1 255.255.255.0
   ```

   配置时钟频率（假设这是DCE端）：
   ```
   Ra(config-if)# clock rate 64000
   ```

   启用接口：
   ```
   Ra(config-if)# no shutdown
   ```

   返回特权模式：
   ```
   Ra(config-if)# end
   ```

### 步骤2：查看路由器版本信息

在特权模式下，使用以下命令查看路由器的版本信息：

```
Ra# show version
```

您将看到类似以下的输出（输出内容可能因Packet Tracer版本不同而有所差异）：

```
Cisco IOS Software, 1841 Software (C1841-ADVIPSERVICESK9-M), Version 12.4(15)T1, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Wed 18-Jul-07 04:52 by pt_team

ROM: System Bootstrap, Version 12.3(8r)T8, RELEASE SOFTWARE (fc1)

Ra uptime is 0 minutes
System returned to ROM by power-on
System image file is "flash:c1841-advipservicesk9-mz.124-15.T1.bin"

Cisco 1841 (revision 6.0) with 114688K/16384K bytes of memory.
Processor board ID FTX0947Z18E
2 FastEthernet interfaces
2 Serial(sync/async) interfaces
1 Virtual Private Network (VPN) Module
DRAM configuration is 64 bits wide with parity disabled.
191K bytes of NVRAM.
62720K bytes of ATA CompactFlash (Read/Write)

Configuration register is 0x2102
```

### 步骤3：查看路由器路由表信息

在特权模式下，使用以下命令查看路由器的路由表信息：

```
Ra# show ip route
```

您将看到类似以下的输出：

```
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

C    1.1.1.0/24 is directly connected, Serial1/2
C    192.168.1.0/24 is directly connected, FastEthernet1/0
```

### 步骤4：查看路由器当前运行配置

在特权模式下，使用以下命令查看路由器当前运行的配置：

```
Ra# show running-config
```

您将看到类似以下的输出：

```
Building configuration...

Current configuration : 1014 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname Ra
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
!
!
ip cef
no ip domain lookup
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
interface FastEthernet0/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet0/1
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface Serial1/2
 ip address 1.1.1.1 255.255.255.0
 clock rate 64000
!
interface FastEthernet1/0
 ip address 192.168.1.1 255.255.255.0
 duplex auto
 speed auto
!
!
ip classless
!
!
!
!
!
!
!
line con 0
line aux 0
line vty 0 4
 login
!
!
end
```

### 步骤5：查看路由器启动配置

在特权模式下，使用以下命令查看路由器保存在NVRAM中的启动配置：

```
Ra# show startup-config
```

如果您还没有保存配置，会显示错误信息：

```
startup-config is not present
```

您可以使用以下命令保存当前配置到NVRAM：

```
Ra# copy running-config startup-config
```

或使用简写命令：

```
Ra# write memory
```

然后再次查看启动配置：

```
Ra# show startup-config
```

### 步骤6：查看接口详细信息

在特权模式下，使用以下命令查看接口的详细信息：

```
Ra# show interfaces FastEthernet1/0
```

您将看到类似以下的输出：

```
FastEthernet1/0 is up, line protocol is up 
  Hardware is Lance, address is 0001.c75e.1401 (bia 0001.c75e.1401)
  Internet address is 192.168.1.1/24
  MTU 1500 bytes, BW 100000 Kbit, DLY 100 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Full-duplex, 100Mb/s
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input never, output never, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue :0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes, 0 no buffer
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     0 packets output, 0 bytes, 0 underruns
     0 output errors, 0 collisions, 0 interface resets
     0 babbles, 0 late collision, 0 deferred
     0 lost carrier, 0 no carrier
     0 output buffer failures, 0 output buffers swapped out
```

### 步骤7：查看接口简要信息

在特权模式下，使用以下命令查看所有接口的简要状态：

```
Ra# show ip interface brief
```

您将看到类似以下的输出：

```
Interface            IP-Address      OK? Method Status                Protocol
FastEthernet0/0      unassigned      YES unset  administratively down down    
FastEthernet0/1      unassigned      YES unset  administratively down down    
Serial1/2            1.1.1.1         YES manual up                    up      
FastEthernet1/0      192.168.1.1     YES manual up                    up   
```

## 命令输出解析

### show version 输出解析

`show version` 命令的输出包含以下重要信息：

1. **Cisco IOS软件版本**：
   - `Cisco IOS Software, 1841 Software (C1841-ADVIPSERVICESK9-M), Version 12.4(15)T1`
   - 表示路由器运行的IOS版本为12.4(15)T1，特性集为ADVIPSERVICESK9

2. **ROM版本**：
   - `ROM: System Bootstrap, Version 12.3(8r)T8, RELEASE SOFTWARE (fc1)`
   - 表示启动程序的版本

3. **路由器型号和内存**：
   - `Cisco 1841 (revision 6.0) with 114688K/16384K bytes of memory`
   - 表示这是一台Cisco 1841路由器，有约112MB的DRAM和16MB的共享内存

4. **接口信息**：
   - `2 FastEthernet interfaces`
   - `2 Serial(sync/async) interfaces`
   - 表示路由器有2个FastEthernet接口和2个串行接口

5. **配置寄存器**：
   - `Configuration register is 0x2102`
   - 表示当前配置寄存器的值，影响路由器的启动行为

### show ip route 输出解析

`show ip route` 命令的输出包含以下重要信息：

1. **路由来源代码**：
   - `C - connected`：直连路由
   - `S - static`：静态路由
   - `R - RIP`：RIP路由
   - 其他各类动态路由协议

2. **路由表项**：
   - `C    1.1.1.0/24 is directly connected, Serial1/2`
   - 表示1.1.1.0/24网络是直连网络，通过Serial1/2接口可达
   - `C    192.168.1.0/24 is directly connected, FastEthernet1/0`
   - 表示192.168.1.0/24网络是直连网络，通过FastEthernet1/0接口可达

### show running-config 输出解析

`show running-config` 命令的输出包含以下重要信息：

1. **系统全局配置**：
   - `hostname Ra`：路由器的主机名
   - `service timestamps debug datetime msec`：调试信息的时间戳格式
   - `no service password-encryption`：密码未加密

2. **接口配置**：
   - `interface Serial1/2`：串行接口配置
     - `ip address 1.1.1.1 255.255.255.0`：IP地址和子网掩码
     - `clock rate 64000`：时钟频率设置（DCE端）
   - `interface FastEthernet1/0`：以太网接口配置
     - `ip address 192.168.1.1 255.255.255.0`：IP地址和子网掩码
     - `duplex auto`：双工模式为自适应
     - `speed auto`：速度为自适应

3. **线路配置**：
   - `line con 0`：控制台线路配置
   - `line vty 0 4`：虚拟终端线路配置
     - `login`：要求登录（但没有设置密码）

## 常见问题和注意事项

1. **配置存储位置**：
   - `show running-config`：显示当前生效的配置，存储在RAM中
   - `show startup-config`：显示启动配置，存储在NVRAM中
   - 路由器重启时，会从NVRAM加载配置到RAM中生效
   - 如果不保存配置，路由器重启后配置将丢失

2. **配置保存**：
   - 使用`copy running-config startup-config`或`write memory`命令保存配置
   - 保存后的配置会在路由器重启后自动加载

3. **版本查看注意事项**：
   - `show version`命令可用于识别路由器型号、IOS版本和功能集
   - 在升级IOS前，必须确认型号和内存是否支持新版本

4. **路由表查看技巧**：
   - 路由表中的条目按照最长匹配原则工作
   - 可以使用`show ip route | begin Gateway`来只查看路由条目部分

5. **接口状态术语**：
   - "up/up"：表示物理层和数据链路层都正常
   - "administratively down/down"：表示接口被手动关闭
   - "up/down"：表示物理层正常但数据链路层有问题

## 扩展知识

### 其他有用的查看命令

1. **查看接口状态**：
   ```
   Ra# show interfaces status
   ```

2. **查看特定协议信息**：
   ```
   Ra# show ip protocols
   ```

3. **查看接口统计信息**：
   ```
   Ra# show interfaces stats
   ```

4. **查看内存使用情况**：
   ```
   Ra# show memory
   ```

5. **查看CPU使用情况**：
   ```
   Ra# show processes cpu
   ```

6. **查看系统日志**：
   ```
   Ra# show logging
   ```

### 使用管道符过滤输出

您可以使用管道符号(|)结合关键字过滤命令输出：

1. **使用include过滤**：
   ```
   Ra# show running-config | include interface
   ```
   只显示包含"interface"的行

2. **使用exclude过滤**：
   ```
   Ra# show running-config | exclude !
   ```
   不显示包含"!"的行（即注释）

3. **使用begin过滤**：
   ```
   Ra# show running-config | begin interface
   ```
   从包含"interface"的行开始显示

4. **使用section过滤**：
   ```
   Ra# show running-config | section Serial1/2
   ```
   显示Serial1/2部分的配置

### 路由器配置备份与恢复

1. **备份配置到TFTP服务器**：
   ```
   Ra# copy running-config tftp
   ```
   系统会提示您输入TFTP服务器地址和文件名

2. **从TFTP服务器恢复配置**：
   ```
   Ra# copy tftp running-config
   ```
   系统会提示您输入TFTP服务器地址和文件名

3. **备份IOS镜像**：
   ```
   Ra# copy flash tftp
   ```
   系统会提示您选择要备份的文件和TFTP服务器信息

### 配置管理最佳实践

1. **配置命名约定**：
   - 使用有意义的主机名，如包含位置和功能信息
   - 为接口添加描述，说明连接的设备或网络

2. **定期备份配置**：
   - 在进行重大更改前备份配置
   - 设置定期自动备份计划

3. **配置文档化**：
   - 记录网络拓扑和IP地址分配
   - 记录变更原因和时间

4. **配置版本控制**：
   - 维护配置的版本历史
   - 在测试环境中验证新配置

5. **配置安全**：
   - 设置强密码
   - 限制访问
   - 考虑加密配置中的密码：`service password-encryption`

---

通过本教程，您已经学习了在Cisco Packet Tracer 8.2.1模拟环境中查看路由器系统和配置信息的方法，掌握了解读输出内容的技巧。这些基础知识对于了解路由器的工作状态、排查网络问题和进行网络规划都至关重要。作为网络管理员，熟练掌握这些命令是日常工作的基础。 