# 路由器命令行界面配置教程（Cisco Packet Tracer 8.2.1模拟环境）

## 目录
1. [实验概述](#实验概述)
2. [模拟环境准备](#模拟环境准备)
3. [路由器命令行操作模式](#路由器命令行操作模式)
4. [详细实验步骤](#详细实验步骤)
5. [命令行基本功能](#命令行基本功能)
6. [常见问题和注意事项](#常见问题和注意事项)
7. [扩展知识](#扩展知识)

## 实验概述

### 实验名称
使用命令行界面

### 实验目的
掌握路由器命令行各种操作模式的区别，以及模式之间的切换。

### 背景描述
作为网络管理员，需要熟悉网络设备的基本操作。本实验将模拟路由器的命令行操作，以帮助您了解和掌握路由器的命令行操作模式。

### 实验环境
本实验在Cisco Packet Tracer 8.2.1模拟软件中进行，无需真实的物理设备。

## 模拟环境准备

### 步骤1：启动Cisco Packet Tracer 8.2.1

打开Cisco Packet Tracer 8.2.1软件。

### 步骤2：创建新拓扑

1. 点击文件菜单中的"新建"或使用快捷键Ctrl+N创建新拓扑
2. 在左侧设备面板中，选择路由器设备
   - 点击"网络设备"选项卡
   - 选择"路由器"类别
   - 拖放1841或2811系列路由器到工作区
   ![创建路由器](https://i.imgur.com/placeholder1.png)

### 步骤3：添加PC并连接Console线

1. 在左侧设备面板中，添加一台PC
   - 点击"终端设备"选项卡
   - 选择"PC"
   - 拖放PC到工作区
2. 连接PC和路由器
   - 选择"连接"选项卡
   - 选择"Console"线缆
   - 点击PC，然后点击路由器的Console口
   ![连接Console](https://i.imgur.com/placeholder2.png)

### 步骤4：访问路由器CLI

1. 点击PC图标
2. 在弹出的对话框中，选择"Desktop"选项卡
3. 点击"Terminal"图标
4. 现在您可以看到路由器的命令行界面，显示`Router>`提示符

## 路由器命令行操作模式

路由器命令行界面有多种操作模式，每种模式提供不同级别的功能和权限：

### 1. 用户模式 (User EXEC Mode)
- **提示符**：`Router>`
- **功能**：基本的监视命令，如ping、telnet等
- **权限**：最低级别的访问权限，只能查看基本信息
- **适用场景**：初次连接路由器时的默认模式

### 2. 特权模式 (Privileged EXEC Mode)
- **提示符**：`Router#`
- **功能**：查看配置、调试和测试
- **权限**：可以查看设备的运行状态和配置
- **进入方式**：从用户模式使用`enable`命令
- **级别**：默认为15级，也可以指定其他级别（如14级）

### 3. 全局配置模式 (Global Configuration Mode)
- **提示符**：`Router(config)#`
- **功能**：配置影响整个设备的参数
- **权限**：可以更改设备的全局配置
- **进入方式**：从特权模式使用`configure terminal`命令

### 4. 接口配置模式 (Interface Configuration Mode)
- **提示符**：`Router(config-if)#`
- **功能**：配置特定接口的参数
- **权限**：可以更改特定接口的配置
- **进入方式**：从全局配置模式使用`interface`命令，如`interface FastEthernet0/0`

### 5. 其他配置模式
- **路由协议配置模式**：`Router(config-router)#`
- **线路配置模式**：`Router(config-line)#`
- **DHCP配置模式**：`Router(dhcp-config)#`
- 等等

### 模式间的切换命令
- **从低级模式到高级模式**：使用特定的进入命令（如`enable`、`configure terminal`等）
- **退回上一级模式**：使用`exit`命令
- **直接返回特权模式**：使用`end`命令或按`Ctrl+Z`
- **直接返回用户模式**：使用`disable`命令（从特权模式）

## 详细实验步骤

### 步骤1：访问路由器的用户模式

当您通过Terminal连接到路由器时，您将自动进入用户模式，提示符为`Router>`。

### 步骤2：进入特权模式

从用户模式，输入以下命令进入特权模式：

```
Router> enable
```

您也可以通过指定级别进入特定权限的特权模式：

```
Router> enable 14
```

输入后，提示符将变为`Router#`，表示已进入特权模式。

### 步骤3：进入全局配置模式

从特权模式，输入以下命令进入全局配置模式：

```
Router# configure terminal
```

或使用简写：

```
Router# conf t
```

系统将显示：

```
Enter configuration commands, one per line. End with CNTL/Z.
Router(config)#
```

### 步骤4：进入接口配置模式

从全局配置模式，输入以下命令进入接口配置模式：

```
Router(config)# interface FastEthernet0/0
```

或使用简写：

```
Router(config)# int fa0/0
```

提示符将变为：

```
Router(config-if)#
```

### 步骤5：退回到上一级模式

在任何配置模式下，输入`exit`命令将退回到上一级模式：

```
Router(config-if)# exit
Router(config)# exit
Router#
```

### 步骤6：直接返回特权模式

在任何配置模式下，输入`end`命令或按`Ctrl+Z`可以直接返回特权模式：

```
Router(config-if)# end
Router#
```

或

```
Router(config-if)# ^Z
Router#
```

### 步骤7：完整的模式切换示例

以下是一个完整的模式切换示例：

```
Router> enable
Router# configure terminal
Enter configuration commands, one per line. End with CNTL/Z.
Router(config)# interface FastEthernet0/0
Router(config-if)# exit
Router(config)# exit
Router# disable
Router>
```

## 命令行基本功能

### 1. 获取帮助信息

在命令行中可以使用问号(?)获取帮助信息：

1. **查看当前模式下可用的所有命令**：
   ```
   Router# ?
   ```
   屏幕将显示所有可用命令及其简要描述。

2. **查看以特定字符开头的命令**：
   ```
   Router# c?
   ```
   屏幕将显示所有以"c"开头的命令：
   ```
   clear  clock  configure  connect  copy
   ```

3. **查看命令的参数选项**：
   ```
   Router# show ?
   ```
   屏幕将显示show命令的所有参数选项。

### 2. 命令的简写

大多数命令可以简写，只要输入足够的字符以区分其他命令即可：

```
Router# conf t    (等同于 configure terminal)
Router(config)# int fa0/0    (等同于 interface FastEthernet0/0)
```

### 3. 命令的自动补齐

在Packet Tracer中，按下Tab键可以自动补齐命令：

```
Router# con[Tab]    (自动补齐为 configure)
```

### 4. 快捷键功能

Packet Tracer中支持以下常用快捷键：

- **Ctrl+C**：中断当前操作（如ping）
- **Ctrl+Z**：从配置模式直接返回特权模式
- **Ctrl+Shift+6**：中断Telnet或Ping等操作
- **上/下箭头**：浏览命令历史
- **Tab键**：自动补齐命令

示例：中断ping操作
```
Router# ping 1.1.1.1
Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```
如果想中断ping操作，可以按下Ctrl+C。

## 常见问题和注意事项

1. **命令简写的唯一性**：
   使用命令简写时，必须确保简写能唯一标识该命令。例如：
   - `Router# conf`可以代表`configure`，因为没有其他以"conf"开头的命令
   - `Router# co`无法代表`configure`，因为还有`copy`命令也是以"co"开头

2. **模式限制**：
   每个操作模式都有特定的命令集，不能跨模式执行命令。例如：
   - 在用户模式下不能执行配置命令
   - 在特权模式下不能直接配置接口参数
   - 必须进入相应的模式才能执行特定的命令

3. **特权级别**：
   路由器支持不同的特权级别(0-15)，不同级别可以执行的命令不同：
   - 级别0：用户模式命令
   - 级别15：所有命令（完全特权模式）
   - 级别1-14：可以通过配置分配特定命令

4. **在Packet Tracer中的差异**：
   - Packet Tracer是模拟环境，某些高级功能可能与真实设备有所不同
   - 某些命令的输出格式可能简化
   - 部分设备特有的命令可能不支持

## 扩展知识

### 1. 路由器的管理方式

路由器有两种主要的管理方式：

1. **带外管理**：
   - 通过Console口连接
   - 不占用网络接口
   - 需要特殊的线缆（Console线）
   - 需要直接物理连接到设备
   - 适用于初始配置或网络故障情况

2. **带内管理**：
   - 通过网络接口（如Telnet、SSH、HTTP）
   - 占用网络接口资源
   - 可以远程管理，不需要直接连接到设备
   - 需要预先配置网络接口和访问方式
   - 适用于日常管理和维护

### 2. 常用的路由器基础配置命令

1. **设置主机名**：
   ```
   Router(config)# hostname MyRouter
   ```

2. **配置接口IP地址**：
   ```
   Router(config)# interface FastEthernet0/0
   Router(config-if)# ip address 192.168.1.1 255.255.255.0
   Router(config-if)# no shutdown
   ```

3. **配置默认路由**：
   ```
   Router(config)# ip route 0.0.0.0 0.0.0.0 192.168.1.254
   ```

4. **配置启用密码**：
   ```
   Router(config)# enable secret cisco
   ```

5. **配置控制台访问**：
   ```
   Router(config)# line console 0
   Router(config-line)# password cisco
   Router(config-line)# login
   ```

6. **配置Telnet访问**：
   ```
   Router(config)# line vty 0 4
   Router(config-line)# password cisco
   Router(config-line)# login
   ```

7. **保存配置**：
   ```
   Router# copy running-config startup-config
   ```
   或
   ```
   Router# write memory
   ```

### 3. 路由器与交换机的区别

1. **功能定位**：
   - 路由器：主要工作在OSI模型的第三层（网络层），能够基于IP地址进行路由决策
   - 交换机：主要工作在OSI模型的第二层（数据链路层），基于MAC地址进行转发

2. **端口类型**：
   - 路由器：通常具有各种类型的接口（串口、以太网口等）
   - 交换机：通常只有以太网端口

3. **配置复杂度**：
   - 路由器：配置相对复杂，需要设置IP地址、路由协议等
   - 交换机：基本功能配置相对简单

4. **命令集**：
   - 路由器：具有更多与路由相关的命令
   - 交换机：具有更多与交换和VLAN相关的命令

---

通过本教程，您已经学习了在Cisco Packet Tracer 8.2.1模拟环境中进行路由器命令行界面配置的基础知识，包括各种操作模式的切换以及命令行的基本功能。这些基础知识对于路由器的配置和管理至关重要。 