# 路由器全局配置教程（Cisco Packet Tracer 8.2.1模拟环境）

## 目录
1. [实验概述](#实验概述)
2. [模拟环境准备](#模拟环境准备)
3. [路由器全局配置技术原理](#路由器全局配置技术原理)
4. [详细实验步骤](#详细实验步骤)
5. [验证配置结果](#验证配置结果)
6. [常见问题和注意事项](#常见问题和注意事项)
7. [扩展知识](#扩展知识)

## 实验概述

### 实验名称
路由器的全局配置

### 实验目的
掌握路由器的全局基本配置，包括设置设备名称和配置登录提示信息。

### 背景描述
作为网络管理员，需要对公司的多台路由器进行区分和管理，包括进行路由器设备名的配置、配置路由器登录时的描述信息，使管理更加规范和清晰。

### 实验环境
本实验在Cisco Packet Tracer 8.2.1模拟软件中进行，无需真实的物理设备。本实验是路由器基本操作系列实验的第二部分。

## 模拟环境准备

### 步骤1：启动Cisco Packet Tracer 8.2.1

打开Cisco Packet Tracer 8.2.1软件。

### 步骤2：创建新拓扑

1. 点击文件菜单中的"新建"或使用快捷键Ctrl+N创建新拓扑
2. 在左侧设备面板中，选择路由器设备
   - 点击"网络设备"选项卡
   - 选择"路由器"类别
   - 拖放1841或2811系列路由器到工作区

### 步骤3：添加PC并连接Console线

1. 在左侧设备面板中，添加一台PC
   - 点击"终端设备"选项卡
   - 选择"PC"
   - 拖放PC到工作区
2. 连接PC和路由器
   - 选择"连接"选项卡
   - 选择"Console"线缆
   - 点击PC，然后点击路由器的Console口

![实验拓扑](https://i.imgur.com/placeholder1.png)

*图1: 实验拓扑*

### 步骤4：访问路由器CLI

1. 点击PC图标
2. 在弹出的对话框中，选择"Desktop"选项卡
3. 点击"Terminal"图标
4. 现在您可以看到路由器的命令行界面，显示`Router>`提示符

## 路由器全局配置技术原理

在进行路由器全局配置前，需要了解以下技术原理：

1. **全局配置模式**：
   - 配置路由器的设备名称和描述信息必须在全局配置模式下执行
   - 从特权模式通过`configure terminal`命令进入全局配置模式
   - 全局配置模式下的更改会影响整个路由器设备

2. **主机名配置**：
   - 使用`hostname`命令配置路由器的设备名称
   - 设备名称会显示在命令提示符的前部分
   - 有效的主机名最多可包含63个字符（Cisco IOS设备），但建议使用22个字符以内的名称
   - 名称可以包含字母、数字和连字符，但不能以数字开头

3. **标题信息配置**：
   - **每日通知(MOTD Banner)**：使用`banner motd`命令配置，对所有用户显示
   - **登录标题(Login Banner)**：使用`banner login`命令配置，在登录过程中显示，位于每日提示信息之后
   - 标题信息可以包含版权声明、安全警告、使用限制等重要信息
   - 需要使用分隔符（如#）来标记标题内容的开始和结束

## 详细实验步骤

### 步骤1：进入特权模式

首先，从用户模式进入特权模式：

```
Router> enable
```

提示符将变为`Router#`，表示已进入特权模式。

### 步骤2：进入全局配置模式

从特权模式，输入以下命令进入全局配置模式：

```
Router# configure terminal
```

或使用简写：

```
Router# conf t
```

系统将显示：

```
Enter configuration commands, one per line. End with CNTL/Z.
Router(config)#
```

### 步骤3：配置路由器设备名称

使用`hostname`命令配置路由器的名称：

```
Router(config)# hostname routeA
```

命令提示符将立即变为新的设备名称：

```
routeA(config)#
```

这表明路由器的主机名已经更改为"routeA"。

### 步骤4：配置每日通知标题(MOTD Banner)

使用`banner motd`命令配置登录路由器时显示的每日通知信息：

```
routeA(config)# banner motd #
Enter TEXT message. End with the character '#'.
***********************************************
*                                             *
*        Welcome to Network Department        *
*         Authorized Access Only!             *
*                                             *
***********************************************
#
```

> 注意：`#`是分隔符，用于标记标题内容的开始和结束。您可以使用任何字符作为分隔符，但需要确保该字符不会出现在标题内容中。

### 步骤5：配置登录标题(Login Banner)

使用`banner login`命令配置登录过程中显示的提示信息：

```
routeA(config)# banner login #
Enter TEXT message. End with the character '#'.
---------------------------------------------------
This system is the property of Example Company.
Unauthorized access is prohibited and will be prosecuted.
If you are not authorized, disconnect IMMEDIATELY!
---------------------------------------------------
#
```

### 步骤6：退出配置模式并保存配置

完成配置后，退出配置模式并保存配置：

```
routeA(config)# exit
routeA# write memory
```

或者使用：

```
routeA# copy running-config startup-config
```

## 验证配置结果

### 测试主机名配置

您可以看到命令提示符已经从`Router`变为`routeA`，这表明主机名已成功配置。

### 测试标题显示

要测试标题是否正确配置，您可以:

1. 退出特权模式返回到用户模式：
   ```
   routeA# disable
   routeA>
   ```

2. 退出当前会话并重新登录：
   ```
   routeA> exit
   ```

3. 重新点击PC上的"Terminal"应用连接到路由器，您应该能够看到配置的MOTD标题和登录标题。

### 查看运行配置

您还可以使用以下命令查看当前的运行配置，确认主机名和标题已正确配置：

```
routeA# show running-config
```

输出中应该包含类似以下的内容：

```
!
hostname routeA
!
banner motd ^C
***********************************************
*                                             *
*        Welcome to Network Department        *
*         Authorized Access Only!             *
*                                             *
***********************************************
^C
banner login ^C
---------------------------------------------------
This system is the property of Example Company.
Unauthorized access is prohibited and will be prosecuted.
If you are not authorized, disconnect IMMEDIATELY!
---------------------------------------------------
^C
!
```

## 常见问题和注意事项

1. **主机名限制**：
   - 主机名最多可包含63个字符（Cisco IOS设备），但建议使用22个字符以内的名称
   - 主机名可以包含字母、数字和连字符，但不能以数字开头
   - 主机名区分大小写

2. **标题分隔符**：
   - 配置标题时，确保选择的分隔符不会出现在标题内容中
   - 常用的分隔符包括#、^C、%等

3. **标题显示顺序**：
   - MOTD标题首先显示，适用于所有连接方式（控制台、Telnet、SSH等）
   - 登录标题在MOTD标题之后，登录提示之前显示

4. **保存配置**：
   - 配置完成后务必保存配置，否则重启后配置将丢失
   - 使用`write memory`或`copy running-config startup-config`命令保存配置

5. **Packet Tracer限制**：
   - Packet Tracer是模拟环境，某些功能可能与真实设备有所不同
   - 某些高级配置选项可能在Packet Tracer中不可用

## 扩展知识

### 其他常用的全局配置命令

除了主机名和标题配置外，还有其他常用的全局配置命令：

1. **配置路由器的域名**：
   ```
   routeA(config)# ip domain-name example.com
   ```

2. **配置时区和时间**：
   ```
   routeA(config)# clock timezone CST 8
   routeA(config)# exit
   routeA# clock set 14:30:00 10 April 2023
   ```

3. **配置用户账户**：
   ```
   routeA(config)# username admin privilege 15 secret Cisco123
   ```

4. **配置启用密码**：
   ```
   routeA(config)# enable secret Cisco123
   ```

5. **配置服务密码加密**：
   ```
   routeA(config)# service password-encryption
   ```

### 标题信息的安全最佳实践

在配置标题信息时，应遵循以下安全最佳实践：

1. **避免泄露敏感信息**：
   - 不要在标题中包含网络拓扑、IP地址范围、路由器型号等敏感信息
   - 不要泄露内部组织结构或联系人信息

2. **包含适当的警告信息**：
   - 明确声明系统的所有权
   - 警告未授权访问的法律后果
   - 告知合法用户的责任

3. **保持专业性**：
   - 使用正式、专业的语言
   - 避免使用俚语、幽默或可能被误解的内容

4. **定期更新标题信息**：
   - 确保法律声明保持最新
   - 根据组织安全政策的变化更新标题内容

---

通过本教程，您已经学习了在Cisco Packet Tracer 8.2.1模拟环境中进行路由器全局配置的方法，掌握了设置路由器主机名和配置登录提示信息的技能。这些基础配置是路由器管理的重要部分，为后续更复杂的配置任务打下了基础。 